Duality4Y/esp8266-firmware/user/board.c
#include <esp8266.h>
#include "gpio.h"
#include "user_io.h"
#include "driver/gpio16.h"
#include "driver/i2c_master.h"
#include "driver/i2c_bmp180.h"
#include "driver/i2c_mma8451.h"
#include "driver/hw_timer.h"

/* SENSORS */

os_timer_t sensorUpdateTimer;

int pressure = -200;
int temperature = -200;
bool accelerometer_found = false;
float acceleration_x = 0;
float acceleration_y = 0;
float acceleration_z = 0;
char acceleration_x_string[6] = {0};
char acceleration_y_string[6] = {0};
char acceleration_z_string[6] = {0};

int ICACHE_FLASH_ATTR power(int base, int exp){
    int result = 1;
    while(exp) { result *= base; exp--; }
    return result;
}

static char* ICACHE_FLASH_ATTR ftoa(float num, uint8_t decimals) {
  // float to string; no float support in esp8266 sdk printf
  // warning: limited to 15 chars & non-reentrant
  // e.g., dont use more than once per os_printf call
  static char* buf[16];
  
  bool neg = false;
  if (num < 0) {
    num = -num;
    neg = true;
  }
  
  int whole = num;
  int decimal = (num - whole) * power(10, decimals);
  if (decimal < 0) {
    // get rid of sign on decimal portion
    decimal -= 2 * decimal;
  }
  char* pattern[10]; // setup printf pattern for decimal portion
  if (neg) {
    os_sprintf(pattern, "-%%d.%%0%dd", decimals);
  } else {
    os_sprintf(pattern, "%%d.%%0%dd", decimals);
  }
  os_sprintf(buf, pattern, whole, decimal);
  return (char *)buf;
}

static void ICACHE_FLASH_ATTR sensorUpdateTimerCb ( void *arg )
{
  board_checkAllInputs();
  #ifdef I2C_BMP180
    pressure = (int) BMP180_GetVal(GET_BMP_REAL_PRESSURE);
    temperature = (int) BMP180_GetVal(GET_BMP_TEMPERATURE);
  #endif
  #ifdef I2C_MMA8451
    if (accelerometer_found) {
      MMA8451_read();
      acceleration_x = MMA8451_gx();
      acceleration_y = MMA8451_gy();
      acceleration_z = MMA8451_gz();
      os_memcpy(acceleration_x_string, ftoa(acceleration_x, 2), 5);
      os_memcpy(acceleration_y_string, ftoa(acceleration_y, 2), 5);
      os_memcpy(acceleration_z_string, ftoa(acceleration_z, 2), 5);
      os_printf("ACC: %s, %s, %s\n\r", acceleration_x_string, acceleration_y_string, acceleration_z_string);
    }
  #endif
  //os_printf("Debug: Sensors updated! (%d, %d)\n\r", pressure, temperature);
}

int ICACHE_FLASH_ATTR board_sensorGetAirPressure ( void )
{
  return pressure;
}

int ICACHE_FLASH_ATTR board_sensorGetTemperature ( void )
{
  return temperature;
}

/* INITIALIZATION */

void ICACHE_FLASH_ATTR board_init( void )
{
  uint32 output_pins = 0;
  uint32 output_init_low = 0;
  uint32 output_init_high = 0;
  uint32 input_pins = 0;

  //Input pins
  #if BUTTON1 == 0 || BUTTON2 == 0 || BUTTON3 == 0 || BUTTON4 == 0 || BUTTON5 == 0 || BUTTON6 == 0 || BUTTON7 == 0 || BUTTON8 == 0 || I2C_MCP_INT == 0
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO0_U, FUNC_GPIO0);
    #ifdef PULLUP_ENABLE_0
      PIN_PULLUP_EN(PERIPHS_IO_MUX_GPIO0_U);
    #else
      PIN_PULLUP_DIS(PERIPHS_IO_MUX_GPIO0_U);
    #endif
    input_pins |= (1<<0);
  #endif
  //GPIO1 can not be used because it is uart TX
  #if BUTTON1 == 2 || BUTTON2 == 2 || BUTTON3 == 2 || BUTTON4 == 2 || BUTTON5 == 0 || BUTTON6 == 0 || BUTTON7 == 0 || BUTTON8 == 0 || I2C_MCP_INT == 2
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO2_U, FUNC_GPIO2);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_GPIO2_U);
    input_pins |= (1<<2);
  #endif
  //GPIO3 can not be used because it is uart RX
  #if BUTTON1 == 4 || BUTTON2 == 4 || BUTTON3 == 4 || BUTTON4 == 4 || BUTTON5 == 0 || BUTTON6 == 0 || BUTTON7 == 0 || BUTTON8 == 0 || I2C_MCP_INT == 4
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO4_U, FUNC_GPIO4);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_GPIO4_U);
    input_pins |= (1<<4);
  #endif
  #if BUTTON1 == 5 || BUTTON2 == 5 || BUTTON3 == 5 || BUTTON4 == 5 || BUTTON5 == 0 || BUTTON6 == 0 || BUTTON7 == 0 || BUTTON8 == 0 || I2C_MCP_INT == 5
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO5_U, FUNC_GPIO5);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_GPIO5_U);
    input_pins |= (1<<5);
  #endif
  //GPIO6 <unknown pin>
  //GPIO7 <unknown pin>
  //GPIO8 <unknown pin>
  //GPIO9 -> May be possible to use on ESP12E, not sure
  //GPIO10 -> May be possible to use on ESP12E, not sure
  //GPIO11 <unknown pin>
  #if BUTTON1 == 12 || BUTTON2 == 12 || BUTTON3 == 12 || BUTTON4 == 12 || BUTTON5 == 0 || BUTTON6 == 0 || BUTTON7 == 0 || BUTTON8 == 0 || I2C_MCP_INT == 12
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTDI_U, FUNC_GPIO12);
    #ifdef PULLUP_ENABLE_12
      PIN_PULLUP_EN(PERIPHS_IO_MUX_MTDI_U);
    #else
      PIN_PULLUP_DIS(PERIPHS_IO_MUX_MTDI_U);
    #endif
    input_pins |= (1<<12);
  #endif
  #if BUTTON1 == 13 || BUTTON2 == 13 || BUTTON3 == 13 || BUTTON4 == 13 || BUTTON5 == 0 || BUTTON6 == 0 || BUTTON7 == 0 || BUTTON8 == 0 || I2C_MCP_INT == 13
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTCK_U, FUNC_GPIO13);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_MTCK_U);
    input_pins |= (1<<13);
  #endif
  #if BUTTON1 == 14 || BUTTON2 == 14 || BUTTON3 == 14 || BUTTON4 == 14 || BUTTON5 == 0 || BUTTON6 == 0 || BUTTON7 == 0 || BUTTON8 == 0 || I2C_MCP_INT == 14
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTMS_U, FUNC_GPIO14);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_MTMS_U);
    input_pins |= (1<<14);
  #endif
  #if BUTTON1 == 15 || BUTTON2 == 15 || BUTTON3 == 15 || BUTTON4 == 15 || BUTTON5 == 0 || BUTTON6 == 0 || BUTTON7 == 0 || BUTTON8 == 0 || I2C_MCP_INT == 15
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTDO_U, FUNC_GPIO15);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_MTDO_U);
    input_pins |= (1<<15);
  #endif
  #if BUTTON1 == 16 || BUTTON2 == 16 || BUTTON3 == 16 || BUTTON4 == 16 || I2C_MCP_INT == 16
    gpio16_input_conf();
  #endif

  //Output pins
  //GPIO0 can not be used because this would cause problems with flashing
  //GPIO1 can not be used because it is uart TX
  #if OUTPUT1 == 2 || OUTPUT2 == 2 || OUTPUT3 == 2 || OUTPUT4 == 2 || OUTPUT5 == 2 || OUTPUT6 == 2 || OUTPUT7 == 2 || OUTPUT8 == 2 || LED == 2 || LED2 == 2
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO2_U, FUNC_GPIO2);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_GPIO2_U);
    output_pins |= (1<<2);
    output_init_low |= (1<<2);
  #endif
  //GPIO3 can not be used because it is uart RX
  #if OUTPUT1 == 4 || OUTPUT2 == 4 || OUTPUT3 == 4 || OUTPUT4 == 4 || OUTPUT5 == 4 || OUTPUT6 == 4 || OUTPUT7 == 4 || OUTPUT8 == 4 || LED == 4 || LED2 == 4
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO4_U, FUNC_GPIO4);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_GPIO4_U);
    output_pins |= (1<<4);
    output_init_low |= (1<<4);
  #endif
  #if OUTPUT1 == 5 || OUTPUT2 == 5 || OUTPUT3 == 5 || OUTPUT4 == 5 || OUTPUT5 == 5 || OUTPUT6 == 5 || OUTPUT7 == 5 || OUTPUT8 == 5 || LED == 5 || LED2 == 5
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO5_U, FUNC_GPIO5);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_GPIO5_U);
    output_pins |= (1<<5);
    output_init_low |= (1<<5);
  #endif
  //GPIO6 <unknown pin>
  //GPIO7 <unknown pin>
  //GPIO8 <unknown pin>
  //GPIO9 -> May be possible to use on ESP12E, not sure
  //GPIO10 -> May be possible to use on ESP12E, not sure
  //GPIO11 <unknown pin>
  #if OUTPUT1 == 12 || OUTPUT2 == 12 || OUTPUT3 == 12 || OUTPUT4 == 12 || OUTPUT5 == 12 || OUTPUT6 == 12 || OUTPUT7 == 12 || OUTPUT8 == 12 || LED == 12 || LED2 == 12
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTDI_U, FUNC_GPIO12);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_MTDI_U);
    output_pins |= (1<<12);
    output_init_low |= (1<<12);
  #endif
  #if OUTPUT1 == 13 || OUTPUT2 == 13 || OUTPUT3 == 13 || OUTPUT4 == 13 || OUTPUT5 == 13 || OUTPUT6 == 13 || OUTPUT7 == 13 || OUTPUT8 == 13 || LED == 13 || LED2 == 13
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTCK_U, FUNC_GPIO13);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_MTCK_U);
    output_pins |= (1<<13);
    output_init_low |= (1<<13);
  #endif
  #if OUTPUT1 == 14 || OUTPUT2 == 14 || OUTPUT3 == 14 || OUTPUT4 == 14 || OUTPUT5 == 14 || OUTPUT6 == 14 || OUTPUT7 == 14 || OUTPUT8 == 14 || LED == 14 || LED2 == 14
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTMS_U, FUNC_GPIO14);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_MTMS_U);
    output_pins |= (1<<14);
    output_init_low |= (1<<14);
  #endif
  #if OUTPUT1 == 15 || OUTPUT2 == 15 || OUTPUT3 == 15 || OUTPUT4 == 15 || OUTPUT5 == 15 || OUTPUT6 == 15 || OUTPUT7 == 15 || OUTPUT8 == 15 || LED == 15 || LED2 == 15
    PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTDO_U, FUNC_GPIO15);
    PIN_PULLUP_DIS(PERIPHS_IO_MUX_MTDO_U);
    output_pins |= (1<<15);
    output_init_low |= (1<<15);
  #endif
  #if OUTPUT1 == 16 || OUTPUT2 == 16 || OUTPUT3 == 16 || OUTPUT4 == 16 || OUTPUT5 == 16 || OUTPUT6 == 16 || OUTPUT7 == 16 || OUTPUT8 == 16 || LED == 16 || LED2 == 16
    gpio16_output_conf();
    gpio16_output_set(0);
  #endif
  gpio_output_set(output_init_high, output_init_low, output_pins, input_pins);

  #ifdef I2C_EN
    i2c_master_gpio_init();
    #ifdef I2C_BMP180
      if (BMP180_Init()==false)
      {
        os_printf("Warning: Could not initialize the air pressure sensor.\n\r");
        os_printf("Warning: This probably indicates a problem with the i2c bus!\n\r");
      }
    #endif
    #ifdef I2C_MCP
      #if I2C_MCP == 1
        //Mode 1: GPIO 0 - 3 are outputs, GPIO 4 - 7 are inputs, no pullup.
        MCP23008_Init(0xF0, 0xF0, 0x00, 0xF0);
        //os_printf("MCP23008 INIT DONE\n\r");
      #endif
      MCP23008_setAll(0); //To be sure: Initialize with all outputs off
    #endif
  #endif

  #if LED>0
    statusLedTimerInit();
  #endif

  #if LED2>0
    statusLed2TimerInit();
  #endif

