Duality4Y/esp8266-firmware/user/board.c
  //Interrupts
  ETS_GPIO_INTR_DISABLE();
  #if BUTTON1>=0 && BUTTON1<20
    ETS_GPIO_INTR_ATTACH(board_handle_gpio_interrupt, BUTTON1);
    gpio_pin_intr_state_set(GPIO_ID_PIN(BUTTON1), 2);
  #endif
  #if BUTTON2>=0 && BUTTON2<20
    ETS_GPIO_INTR_ATTACH(board_handle_gpio_interrupt, BUTTON2);
    gpio_pin_intr_state_set(GPIO_ID_PIN(BUTTON2), 2);
  #endif
  #if BUTTON3>=0 && BUTTON3<20
    ETS_GPIO_INTR_ATTACH(board_handle_gpio_interrupt, BUTTON3);
    gpio_pin_intr_state_set(GPIO_ID_PIN(BUTTON3), 2);
  #endif
  #if BUTTON4>=0 && BUTTON4<20
    ETS_GPIO_INTR_ATTACH(board_handle_gpio_interrupt, BUTTON4);
    gpio_pin_intr_state_set(GPIO_ID_PIN(BUTTON4), 2);
  #endif
  #if BUTTON5>=0 && BUTTON5<20
    ETS_GPIO_INTR_ATTACH(board_handle_gpio_interrupt, BUTTON5);
    gpio_pin_intr_state_set(GPIO_ID_PIN(BUTTON5), 2);
  #endif
  #if BUTTON6>=0 && BUTTON6<20
    ETS_GPIO_INTR_ATTACH(board_handle_gpio_interrupt, BUTTON6);
    gpio_pin_intr_state_set(GPIO_ID_PIN(BUTTON6), 2);
  #endif
  #if BUTTON7>=0 && BUTTON7<20
    ETS_GPIO_INTR_ATTACH(board_handle_gpio_interrupt, BUTTON7);
    gpio_pin_intr_state_set(GPIO_ID_PIN(BUTTON7), 2);
  #endif
  #if BUTTON8>=0 && BUTTON8<20
    ETS_GPIO_INTR_ATTACH(board_handle_gpio_interrupt, BUTTON8);
    gpio_pin_intr_state_set(GPIO_ID_PIN(BUTTON8), 2);
  #endif
  #ifdef I2C_MCP_INT
    //The MCP chip has it's interrupt pin connected to I2C_MCP_INT, handle interrupts!
    ETS_GPIO_INTR_ATTACH(board_handle_gpio_interrupt, I2C_MCP_INT);
    gpio_pin_intr_state_set(GPIO_ID_PIN(I2C_MCP_INT), 2);
  #endif
  ETS_GPIO_INTR_ENABLE();

  #ifdef PWM_ENABLE
    hw_timer_init(FRC1_SOURCE, 1);
    hw_timer_set_func( pwmCb );
    hw_timer_arm(50);
  #endif

  #ifdef I2C_MMA8451
    accelerometer_found = MMA8451_Init();
    if (accelerometer_found) {
      MMA8451_setRange(MMA8451_RANGE_2_G);
      os_printf("Accelerometer range is %d G\n\r", 2 << MMA8451_getRange());
    }
    else
    {
      os_printf("Warning: Could not initialize accelerometer.\n\r");
      os_printf("Warning: This probably indicates a problem with the i2c bus!\n\r");
    }
  #endif

  os_memset(&sensorUpdateTimer,0,sizeof(os_timer_t));
  os_timer_disarm(&sensorUpdateTimer);
  os_timer_setfn(&sensorUpdateTimer, (os_timer_func_t *)sensorUpdateTimerCb, NULL);
  os_timer_arm(&sensorUpdateTimer, 2000, 1);
}

/* PWM */

uint8_t pwmr = 10;
uint8_t pwmg = 10;
uint8_t pwmb = 10;
uint8_t pwmcnt = 0;
bool pwmstater = true;
bool pwmstateg = true;
bool pwmstateb = true;

void ICACHE_FLASH_ATTR setPWM(uint8_t r, uint8_t g, uint8_t b)
{
  pwmr = r;
  pwmg = g;
  pwmb = b;
}

void pwmCb( void )
{
  #ifdef PWM_ENABLE
  pwmcnt++;
  if (pwmcnt>255) pwmcnt = 0;

  if ((pwmr<pwmcnt)&&(pwmstater))
  {
    board_setOutput( OUTPUT1, false );
    pwmstater = false;
  }

  if ((pwmg<pwmcnt)&&(pwmstateg))
  {
    board_setOutput( OUTPUT2, false );
    pwmstateg = false;
  }

  if ((pwmb<pwmcnt)&&(pwmstateb))
  {
    board_setOutput( OUTPUT3, false );
    pwmstateb = false;
  }

  if (pwmcnt==0)
  {
    board_setOutput( OUTPUT1, true );
    board_setOutput( OUTPUT2, true );
    board_setOutput( OUTPUT3, true );
    pwmstater = true;
    pwmstateg = true;
    pwmstateb = true;
  }
  #endif
}

/* INPUTS */

bool ignore_btn1_int = false;
bool ignore_btn2_int = false;
bool ignore_btn3_int = false;
bool ignore_btn4_int = false;
bool ignore_btn5_int = false;
bool ignore_btn6_int = false;
bool ignore_btn7_int = false;
bool ignore_btn8_int = false;

void board_checkAllInputs( void )
{
  #if BUTTON1>=0 && BUTTON1<20
  if ((!ignore_btn1_int)&&(!GPIO_INPUT_GET(BUTTON1))) { handleButtonInterrupt(0); ignore_btn1_int = 1; } else { ignore_btn1_int = 0; }
  #endif
  #if BUTTON2>=0 && BUTTON2<20
  if ((!ignore_btn2_int)&&(!GPIO_INPUT_GET(BUTTON2))) { handleButtonInterrupt(1); ignore_btn2_int = 1; } else { ignore_btn2_int = 0; }
  #endif
  #if BUTTON3>=0 && BUTTON3<20
  if ((!ignore_btn3_int)&&(!GPIO_INPUT_GET(BUTTON3))) { handleButtonInterrupt(2); ignore_btn3_int = 1; } else { ignore_btn3_int = 0; }
  #endif
  #if BUTTON4>=0 && BUTTON4<20
  if ((!ignore_btn4_int)&&(!GPIO_INPUT_GET(BUTTON4))) { handleButtonInterrupt(3); ignore_btn4_int = 1; } else { ignore_btn4_int = 0; }
  #endif
  #if BUTTON5>=0 && BUTTON5<20
  if ((!ignore_btn5_int)&&(!GPIO_INPUT_GET(BUTTON5))) { handleButtonInterrupt(4); ignore_btn5_int = 1; } else { ignore_btn5_int = 0; }
  #endif
  #if BUTTON6>=0 && BUTTON6<20
  if ((!ignore_btn6_int)&&(!GPIO_INPUT_GET(BUTTON6))) { handleButtonInterrupt(5); ignore_btn6_int = 1; } else { ignore_btn6_int = 0; }
  #endif
  #if BUTTON7>=0 && BUTTON7<20
  if ((!ignore_btn7_int)&&(!GPIO_INPUT_GET(BUTTON7))) { handleButtonInterrupt(6); ignore_btn7_int = 1; } else { ignore_btn7_int = 0; }
  #endif
  #if BUTTON8>=0 && BUTTON8<20
  if ((!ignore_btn8_int)&&(!GPIO_INPUT_GET(BUTTON8))) { handleButtonInterrupt(7); ignore_btn8_int = 1; } else { ignore_btn8_int = 0; }
  #endif

  #if I2C_MCP_INT>0
    uint8_t mcp = MCP23008_getAll();
    #if BUTTON1>=94 && BUTTON1<98
      if ((!ignore_btn1_int)&&(mcp&(1<<(BUTTON1-94+4)))) { handleButtonInterrupt(0); ignore_btn1_int = 1; } else { ignore_btn1_int = 0; }
    #endif
    #if BUTTON2>=94 && BUTTON2<98
      if ((!ignore_btn2_int)&&(mcp&(1<<(BUTTON2-94+4)))) { handleButtonInterrupt(1); ignore_btn2_int = 1; } else { ignore_btn2_int = 0; }
    #endif
    #if BUTTON3>=94 && BUTTON3<98
      if ((!ignore_btn3_int)&&(mcp&(1<<(BUTTON3-94+4)))) { handleButtonInterrupt(2); ignore_btn3_int = 1; } else { ignore_btn3_int = 0; }
    #endif
    #if BUTTON4>=94 && BUTTON4<98
      if ((!ignore_btn4_int)&&(mcp&(1<<(BUTTON4-94+4)))) { handleButtonInterrupt(3); ignore_btn4_int = 1; } else { ignore_btn4_int = 0; }
    #endif
    #if BUTTON5>=94 && BUTTON5<98
      if ((!ignore_btn5_int)&&(mcp&(1<<(BUTTON5-94+4)))) { handleButtonInterrupt(4); ignore_btn5_int = 1; } else { ignore_btn5_int = 0; }
    #endif
    #if BUTTON6>=94 && BUTTON6<98
      if ((!ignore_btn6_int)&&(mcp&(1<<(BUTTON6-94+4)))) { handleButtonInterrupt(5); ignore_btn6_int = 1; } else { ignore_btn6_int = 0; }
    #endif
    #if BUTTON7>=94 && BUTTON7<98
      if ((!ignore_btn7_int)&&(mcp&(1<<(BUTTON7-95+4)))) { handleButtonInterrupt(6); ignore_btn7_int = 1; } else { ignore_btn7_int = 0; }
    #endif
    #if BUTTON8>=94 && BUTTON8<98
      if ((!ignore_btn8_int)&&(mcp&(1<<(BUTTON8-95+4)))) { handleButtonInterrupt(7); ignore_btn8_int = 1; } else { ignore_btn8_int = 0; }
    #endif
    mcp = MCP23008_getAll_intcap(); //Unused but does clear MCP interrupt
  #endif
}

void ICACHE_FLASH_ATTR board_handle_gpio_interrupt( int8_t key )
{
  ETS_GPIO_INTR_DISABLE();
  //os_printf("[board_handle_gpio_interrupt with key %d]\n\r",key); //Key arg does not seem to work :(

  os_timer_disarm(&sensorUpdateTimer);
  sensorUpdateTimerCb(0);
  os_timer_arm(&sensorUpdateTimer, 2000, 1);

  //Reset interrupts
  ETS_GPIO_INTR_ENABLE();
  uint32 gpio_status = GPIO_REG_READ(GPIO_STATUS_ADDRESS);
  GPIO_REG_WRITE(GPIO_STATUS_W1TC_ADDRESS, gpio_status );
}

bool ICACHE_FLASH_ATTR board_getInput( uint8_t input )
{
  #if BUTTON1>=0 && BUTTON1<20
  if ((!GPIO_INPUT_GET(BUTTON1))&&(input==0)) return true;
  #endif
  #if BUTTON2>=0 && BUTTON2<20
  if ((!GPIO_INPUT_GET(BUTTON2))&&(input==1)) return true;
  #endif
  #if BUTTON3>=0 && BUTTON3<20
  if ((!GPIO_INPUT_GET(BUTTON3))&&(input==2)) return true;
  #endif
  #if BUTTON4>=0 && BUTTON4<20
  if ((!GPIO_INPUT_GET(BUTTON4))&&(input==3)) return true;
  #endif
  #if BUTTON5>=0 && BUTTON5<20
  if ((!GPIO_INPUT_GET(BUTTON5))&&(input==4)) return true;
  #endif
  #if BUTTON6>=0 && BUTTON6<20
  if ((!GPIO_INPUT_GET(BUTTON6))&&(input==5)) return true;
  #endif
  #if BUTTON7>=0 && BUTTON7<20
  if ((!GPIO_INPUT_GET(BUTTON7))&&(input==6)) return true;
  #endif
  #if BUTTON8>=0 && BUTTON8<20
  if ((!GPIO_INPUT_GET(BUTTON8))&&(input==7)) return true;
  #endif

