Duality4Y/esp8266-firmware/user/board.c
  #ifdef I2C_MCP
    uint8_t mcp = MCP23008_getAll();
    #if BUTTON1>=94 && BUTTON1<98
      if ((mcp&(1<<(BUTTON1-94+3)))&&(input==0)) return true;
    #endif
    #if BUTTON2>=94 && BUTTON2<98
      if ((mcp&(1<<(BUTTON2-94+3)))&&(input==1)) return true;
    #endif
    #if BUTTON3>=94 && BUTTON3<98
      if ((mcp&(1<<(BUTTON3-94+3)))&&(input==2)) return true;
    #endif
    #if BUTTON4>=94 && BUTTON4<98
      if ((mcp&(1<<(BUTTON4-94+3)))&&(input==3)) return true;
    #endif
    #if BUTTON5>=94 && BUTTON5<98
      if ((mcp&(1<<(BUTTON5-94+3)))&&(input==4)) return true;
    #endif
    #if BUTTON6>=94 && BUTTON6<98
      if ((mcp&(1<<(BUTTON6-94+3)))&&(input==5)) return true;
    #endif
    #if BUTTON7>=94 && BUTTON7<98
      if ((mcp&(1<<(BUTTON7-95+3)))&&(input==6)) return true;
    #endif
    #if BUTTON8>=94 && BUTTON8<98
      if ((mcp&(1<<(BUTTON8-95+3)))&&(input==7)) return true;
    #endif
  #endif
  return false;
}

/* OUTPUTS */

uint32_t outputState = 0;
uint32_t MCPoutputState = 0;

bool board_setOutput( int output, bool state )
{
  switch (output) {
    #if OUTPUT1>=0
    case OUTPUT1: break;
    #endif
    #if OUTPUT2>=0
    case OUTPUT2: break;
    #endif
    #if OUTPUT3>=0
    case OUTPUT3: break;
    #endif
    #if OUTPUT4>=0
    case OUTPUT4: break;
    #endif
    #if OUTPUT5>=0
    case OUTPUT5: break;
    #endif
    #if OUTPUT6>=0
    case OUTPUT6: break;
    #endif
    #if OUTPUT7>=0
    case OUTPUT7: break;
    #endif
    #if OUTPUT8>=0
    case OUTPUT8: break;
    #endif
    #if LED>=0
    case LED: break;
    #endif
    #if LED2>=0
    case LED2: break;
    #endif
    default:
      return false;
  }

  if (output<0) return false;

  if (output < 16)
  {
    if (state)
    {
      outputState |= (1<<output);
    }
    else
    {
      outputState &= ~(1<<output);
    }
    //os_printf("<SETOUTPUT> %x, %x\n\r", outputState, ~outputState);
    gpio_output_set(outputState, ~outputState, 0, 0);
    return true;
  }
  else if (output == 16)
  {
    gpio16_output_set(state);
    if (state)
    {
      outputState |= (1<<output);
    }
    else
    {
      outputState &= ~(1<<output);
    }
    return true;
  }
  #ifdef I2C_MCP
    else if ((output >= 90) && (output<94))
    {
      MCP23008_setOutput(output-90, state);
      if (state)
      {
        MCPoutputState |= (1<<(output-90));
      }
      else
      {
        MCPoutputState &= ~(1<<(output-90));
      }
      return true;
    }
  #endif
  else
  {
    os_printf("Can not set output on pin %d: unknown pin.\r\n");
    return false;
  }
}

bool ICACHE_FLASH_ATTR board_getOutput( int output )
{
  switch (output) {
    #if OUTPUT1>=0
    case OUTPUT1: break;
    #endif
    #if OUTPUT2>=0
    case OUTPUT2: break;
    #endif
    #if OUTPUT3>=0
    case OUTPUT3: break;
    #endif
    #if OUTPUT4>=0
    case OUTPUT4: break;
    #endif
    #if OUTPUT5>=0
    case OUTPUT5: break;
    #endif
    #if OUTPUT6>=0
    case OUTPUT6: break;
    #endif
    #if OUTPUT7>=0
    case OUTPUT7: break;
    #endif
    #if OUTPUT8>=0
    case OUTPUT8: break;
    #endif
    default:
      return false;
  }
  if ((output > 0) && (output < 17))
  {
    return ((outputState&(1<<output))>>output)&0x01;
  }
  else if ((output >= 90) && (output<94))
  {
    return ((MCPoutputState&(1<<(output-90)))>>(output-90))&0x01;
  }
  return false;
}

/* STATUS LEDS */

bool statusLed_blinkState = false;
os_timer_t statusLedTimer;

static void ICACHE_FLASH_ATTR statusLedTimerCb(void *arg)
{
  statusLed_blinkState = (!statusLed_blinkState)&0x01;
  #if LED>0
    board_setOutput( LED, statusLed_blinkState );
  #endif
}

void ICACHE_FLASH_ATTR statusLedTimerInit()
{
  os_memset(&statusLedTimer,0,sizeof(os_timer_t));
  os_timer_disarm(&statusLedTimer);
  os_timer_setfn(&statusLedTimer, (os_timer_func_t *)statusLedTimerCb, NULL);
}

void ICACHE_FLASH_ATTR statusLedTimerSet(uint32_t ms)
{
  os_timer_disarm(&statusLedTimer);
  os_timer_arm(&statusLedTimer, ms, 1);
}

void ICACHE_FLASH_ATTR statusLedTimerStop( void )
{
  os_timer_disarm(&statusLedTimer);
}

void ICACHE_FLASH_ATTR board_statusLed( uint8_t mode )
{
  #if LED>0
    os_printf("Statusled 1 set to %d\n\r", mode);
    switch (mode)
    {
      case 0:
        statusLedTimerStop();
        board_setOutput( LED, false );
        break;
      case 1:
        statusLedTimerStop();
        board_setOutput( LED, true );
        break;
      case 2:
        statusLedTimerSet( 500 );
        break;
      case 3:
        statusLedTimerSet( 250 );
        break;
      case 4:
        statusLedTimerSet( 100 );
        break;
      default:
        //Do nothing
        break;
    }
  #endif
}

bool statusLed2_blinkState = false;
os_timer_t statusLed2Timer;

static void ICACHE_FLASH_ATTR statusLed2TimerCb(void *arg)
{
  statusLed2_blinkState = (!statusLed2_blinkState)&0x01;
  #if LED2>0
    board_setOutput( LED2, statusLed2_blinkState );
  #endif
}

void ICACHE_FLASH_ATTR statusLed2TimerInit()
{
  os_memset(&statusLed2Timer,0,sizeof(os_timer_t));
  os_timer_disarm(&statusLed2Timer);
  os_timer_setfn(&statusLed2Timer, (os_timer_func_t *)statusLed2TimerCb, NULL);
}

void ICACHE_FLASH_ATTR statusLed2TimerSet(uint32_t ms)
{
  os_timer_disarm(&statusLed2Timer);
  os_timer_arm(&statusLed2Timer, ms, 1);
}

void ICACHE_FLASH_ATTR statusLed2TimerStop( void )
{
  os_timer_disarm(&statusLed2Timer);
}


void ICACHE_FLASH_ATTR board_statusLed2( uint8_t mode )
{
  #if LED2>0
    os_printf("Statusled 2 set to %d\n\r", mode);
    switch (mode)
    {
      case 0:
        statusLed2TimerStop();
        board_setOutput( LED2, false );
        break;
      case 1:
        statusLed2TimerStop();
        board_setOutput( LED2, true );
        break;
      case 2:
        statusLed2TimerSet( 500 );
        break;
      case 3:
        statusLed2TimerSet( 250 );
        break;
      case 4:
        statusLed2TimerSet( 100 );
        break;
      default:
        //Do nothing
        break;
    }
  #endif
}

/*#define REG_PIN_HIGH 0x6000304;
#define REG_PIN_LOW 0x6000308; */

void ICACHE_FLASH_ATTR SEND_WS_0()
{
	uint8_t time;
  #ifdef WS2812
	time = 4; while(time--) WRITE_PERI_REG( PERIPHS_GPIO_BASEADDR + 4, (1<<WS2812) );
	time = 9; while(time--) WRITE_PERI_REG( PERIPHS_GPIO_BASEADDR + 8, (1<<WS2812) );
  #endif
}

void ICACHE_FLASH_ATTR SEND_WS_1()
{
	uint8_t time;
  #ifdef WS2812
	time = 8; while(time--) WRITE_PERI_REG( PERIPHS_GPIO_BASEADDR + 4, (1<<WS2812) );
	time = 6; while(time--) WRITE_PERI_REG( PERIPHS_GPIO_BASEADDR + 8, (1<<WS2812) );
  #endif
}

void ICACHE_FLASH_ATTR board_setWS2812( uint8_t * buffer, uint16_t length )
{
	uint16_t i;
  #ifdef WS2812
  	ets_intr_lock();
  	GPIO_OUTPUT_SET(GPIO_ID_PIN(WS2812), 0);

  	for( i = 0; i < length; i++ )
  	{
  		uint8_t mask = 0x80;
  		uint8_t byte = buffer[i];
  		while (mask)
  		{
  			( byte & mask ) ? SEND_WS_1() : SEND_WS_0();
  			mask >>= 1;
      }
  	}
  	ets_intr_unlock();
  #endif
}
